Revit 2027 API
Connector.PipeSystemType Property
The pipe system type of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PipeSystemType PipeSystemType { get; }
Public ReadOnly Property PipeSystemType As PipeSystemType
	Get
public:
property PipeSystemType PipeSystemType {
	PipeSystemType get ();
}
member PipeSystemType : PipeSystemType with get
Property Value
PipeSystemType
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the connector's domain is not DomainPiping.
InvalidOperationException |  Thrown on failure to get pipe system type.
Remarks
Instantaneous system type at this connector, calculated according to system. For unconnected connectors, system type is undefined.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace